class Constant:
    START_TXT = ('Привет! Я Happy Birthday бот. Я помогу тебе не забывать дни рождения важных для тебя людей 😊\n'
                 'Чтобы добавить кого-то достаточно нажать кнопку "Добавить друга" и следовать дальнейшим инструкциям.\n'
                 'Если необходимо просмотреть, кто из друзей добавлен - нажми "Получить список друзей".')

    BUTTON_ADD = 'Добавить друга'
    BUTTON_GET = 'Получить список друзей'

    ADD_TEXT = ('Введи имя друга и день рождения в формате ММ-ДД через запятую.\n'
                'Например: Иван, 06-12 или Иван Иванов, 06-12.')

    DATA_SAVE = ('Данные сохранены!\n'
                 'Теперь в нужный день тебе придет уведомление 🎉')

    WRONG_FORMAT = 'Неверный формат. Нажми кнопку "Добавить друга" и введи имя и дату в формате: Иван, 12-31.'

    EMPTY_LIST = 'Список твоих друзей пуст 😢\n'

